app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Computer Science III"], ["updated_at", "2021-06-09 06:09:40.960786"], ["id", 3]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params)